-- phpMyAdmin SQL Dump
-- version 4.7.3
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Ноя 28 2017 г., 16:18
-- Версия сервера: 5.6.37
-- Версия PHP: 5.5.38

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `map`
--

-- --------------------------------------------------------

--
-- Структура таблицы `student`
--

CREATE TABLE `student` (
  `id_stud` int(100) NOT NULL,
  `name` varchar(100) NOT NULL,
  `surname` varchar(100) NOT NULL,
  `patronymic` varchar(100) NOT NULL,
  `room` int(100) NOT NULL,
  `floor` int(100) NOT NULL,
  `faculty` varchar(100) NOT NULL,
  `phone` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `student`
--

INSERT INTO `student` (`id_stud`, `name`, `surname`, `patronymic`, `room`, `floor`, `faculty`, `phone`) VALUES
(1, 'Михаил', 'Бондаренко', 'Алексеевич', 1, 1, 'ФМИ', '+79247776677'),
(2, 'Игорь', 'Пучков', 'Александрович', 1, 1, 'ФМИ', '+79245553535'),
(3, 'Александр', 'Соколов', 'Степанович', 2, 1, 'ФМИ', '+79098034578'),
(4, 'Дмитрий', 'Нагиев', 'Сергеевич', 2, 1, 'ФМИ', '+79145557898'),
(5, 'Дмитрий', 'Буданов', 'Олегович', 3, 1, 'ФМИ', '+77777777777'),
(6, 'Олег', 'Степанов', 'Петрович', 3, 1, 'ФМИ', '+79145552145'),
(7, 'Дарья', 'Шкроб', 'Владимировна', 4, 1, 'ФМИ', '+79096567812'),
(8, 'Полина', 'Борисова', 'Олеговна', 4, 1, 'ФМИ', '+79995052349'),
(9, 'Евгения', 'Хоменко', 'Юрьевна', 5, 1, 'ФМИ', '+79631238574'),
(10, 'Анастасия', 'Болмасова', 'Дмитриевна', 5, 1, 'ФМИ', '+79634571245'),
(11, 'Денис', 'Костенюк', 'Олегович', 6, 1, 'ФМИ', '+79146938745'),
(12, 'Иван', 'Игнатенко', 'Евгеньевич', 6, 1, 'ФМИ', '+79245554798'),
(13, 'Яна', 'Янчук', 'Олеговна', 7, 1, 'ФМИ', '+7909526587'),
(14, 'Елена', 'Гаськова', 'Олеговна', 7, 1, 'ФМИ', '+79145267841'),
(15, 'Кирилл', 'Калинин', 'Игоревич', 8, 1, 'ФМИ', '+79245697824'),
(16, 'Юрий', 'Сысолятин', 'Альбертович', 8, 1, 'ФМИ', '+79639867457'),
(17, 'Руслан', 'Мифтахов', 'Михайлович', 9, 1, 'ФМИ', '+79241536978'),
(18, 'Константин', 'Горохов', 'Эдуардович', 9, 1, 'ФМИ', '+79094898745'),
(19, 'Людмила', 'Глухова', 'Петровна', 10, 1, 'ФМИ', '+79145253146'),
(20, 'Яна', 'Фертикова', 'Владимировна', 10, 1, 'ФМИ', '+79634567812'),
(21, 'Дмитрий', 'Жойдик', 'Васильевич', 11, 1, 'ФМИ', '+79143264587'),
(22, 'Иван', 'Сапронов', 'Андреевич', 11, 1, 'ФМИ', '+79247413296'),
(23, 'Дмитрий', 'Ширимов', 'Геннадьевич', 12, 1, 'ФМИ', '+79141112565'),
(24, 'Павел', 'Швец', 'Родионович', 12, 1, 'ФМИ', '+79093335285'),
(25, 'Виталий', 'Гогунский', 'Дмитриевич', 13, 1, 'ФМИ', '+79634449631'),
(26, 'Роман', 'Жгунов', 'Валерьевич', 13, 1, 'ФМИ', '+79246667799'),
(27, 'Любовь', 'Соловцова', 'Александровна', 14, 1, 'ФМИ', '+79094566666'),
(28, 'Ирина', 'Акилова', 'Михайловна', 14, 1, 'ФМИ', '+79146279367');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`id_stud`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
